artillery/user-operations.yml
config:
  target: "http://localhost:4000"
   
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 20
      name: Ramp up load
    # - duration: 600
    #   arrivalRate: 50
    # - duration: 200
    #   arrivalRate: 50
      # name: Sustained load
  # payload:
  #   path: "token.csv"
  #   fields:
  #     - "token"
  #   skipHeader: true
before:
    flow:
      - log: "Get auth token"
      - post:
          url: "/login"
          json:
            login: "admin"
            password: "admin"
          expect:
            - statusCode: 201
          capture:
            - json: "$.token"
              as: "token"

scenarios:
  - name: "CRUD operations with user"
    flow:       
      - log: "Getting all users"
      - get:
          headers:
            Authorization: "Bearer {{ token }}"
          url: "/users"
          expect:
            - statusCode: 200
      - log: "Creating user"
      - post:
          url: "/users"
          headers:
            Authorization: "Bearer {{ token }}"          
          json:
            login: "user"
            password: "user"
            name: "user"
          expect:
            - statusCode: 201
          capture:
            - json: "$.id"
              as: "userId"
      - log: "Getting single user"
      - get:
          url: "/users/{{ userId }}"
          expect:
            - statusCode: 200
      - log: "Amending user details"
      - put:
          headers:
            Authorization: "Bearer {{ token }}"
          url: "/users/{{ userId }}"
          json:
            name: "new name"
          expect:
            - statusCode: 200
      - log: "Deleting user"
      - delete:
          headers:
            Authorization: "Bearer {{ token }}"
          url: "/users/{{ userId }}"
          expect:
            - statusCode: 200